#ifndef ICED_DISASSEMBLER_H
#define ICED_DISASSEMBLER_H

#include "CommonDisassembler.hpp"
#include "CommonMnemonics.h"
#include "CommonRegisters.h"
#include "icedDisassembler_mnemonics.h"
#include "icedDisassembler_registers.h"
#include "utils.h"

#include <Zydis/Register.h>
#include <Zydis/SharedTypes.h>
#include <Zydis/Zydis.h>

#include <cstddef>
#include <magic_enum/magic_enum.hpp>

// todo, fix names
// instead of mnemonic, do MergenMnemonic ?

struct icedObj {
  uint16_t mnemonic;

  // we only care about explicit operands in this struct

  // we can do this because x86 allows maximum of one mem operand

  uint8_t mem_base;
  uint8_t mem_index;
  uint8_t mem_scale;

  uint8_t stack_growth;

  uint8_t regs[4];
  uint8_t types[4];

  // instruction prefix, attributes
  uint8_t attributes;

  uint8_t length;
  uint8_t operand_count_visible;

  // TODO : 32 bit
  uint64_t immediate; //
  union {
    uint64_t mem_disp;
    uint64_t immediate2;
  };
  char* text;
};

static_assert(offsetof(icedObj, mnemonic) == 0, "invalid offset");
static_assert(offsetof(icedObj, mem_base) == 2, "invalid offset");
static_assert(offsetof(icedObj, mem_index) == 3, "invalid offset");
static_assert(offsetof(icedObj, mem_scale) == 4, "invalid offset");
static_assert(offsetof(icedObj, stack_growth) == 5, "invalid offset");
static_assert(offsetof(icedObj, regs) == 6, "invalid offset");
static_assert(offsetof(icedObj, types) == 10, "invalid offset");
static_assert(offsetof(icedObj, attributes) == 14, "invalid offset");
static_assert(offsetof(icedObj, length) == 15, "invalid offset");
static_assert(offsetof(icedObj, operand_count_visible) == 16, "invalid offset");
static_assert(offsetof(icedObj, immediate) == 24, "invalid offset");
static_assert(offsetof(icedObj, immediate2) == 32, "invalid offset");
static_assert(offsetof(icedObj, text) == 40, "invalid offset");

extern "C" {
int disas(void* obj, const void* code, size_t len);
}

template <typename Mnemonic>
Mnemonic icedToMergenMnemonics(IcedMnemonics_internal mnemonic) {
  if constexpr (std::is_same_v<Mnemonic, IcedMnemonics>) {
    // move this to rust
    if (mnemonic == IcedMnemonics_internal::Sal)
      return Mnemonic::SHL;
    return static_cast<Mnemonic>(mnemonic);
  }
  switch (mnemonic) {
  case IcedMnemonics_internal::Aaa:
    return Mnemonic::AAA;
  case IcedMnemonics_internal::Aad:
    return Mnemonic::AAD;
  case IcedMnemonics_internal::Aadd:
    return Mnemonic::AADD;
  case IcedMnemonics_internal::Aam:
    return Mnemonic::AAM;
  case IcedMnemonics_internal::Aand:
    return Mnemonic::AAND;
  case IcedMnemonics_internal::Aas:
    return Mnemonic::AAS;
  case IcedMnemonics_internal::Adc:
    return Mnemonic::ADC;
  case IcedMnemonics_internal::Adcx:
    return Mnemonic::ADCX;
  case IcedMnemonics_internal::Add:
